<?php
/*
|--------------------------------------------------------------------------
| Author: inlanger
| www:    http://inlanger.org.ua
| mail:   mail@inlanger.org.ua
|--------------------------------------------------------------------------
*/

/*
|--------------------------------------------------------------------------
| Login/
|--------------------------------------------------------------------------
*/
$lang['logged_in'] = "%s вошёл";
$lang['logged_out'] = "%s вышел";
$lang['dev_pwd_instructions'] = 'В настоящее время сайт в разработке и для его просмотра необходим пароль.';

/*
|--------------------------------------------------------------------------
| Generic Module
|--------------------------------------------------------------------------
*/
$lang['module_created']= "%1s элемент <em>%2s</em> создан";
$lang['module_edited'] = "%1s элемент <em>%2s</em> отредактирован";
$lang['module_deleted'] = "%1s элемент для <em>%2s</em> удалён";
$lang['module_restored'] = "%1s элемент восстановлен из архива";
$lang['module_instructions_default'] = "Сдесь вы можете управлять %1s для своего сайта.";

$lang['cannot_determine_module'] = "Невозможно определить модуль.";
$lang['incorrect_route_to_module'] = "Неправильный путь для доступа к модулю.";
$lang['data_saved'] = 'Данные сохранены.';
$lang['data_deleted'] = 'Данные удалены.';
$lang['no_data'] = 'Нет данных для отображения.';
$lang['no_preview_path'] = 'Для этого модуля не установлен путь для предпросмотра.';


/*
|--------------------------------------------------------------------------
| Login/Password Reset
|--------------------------------------------------------------------------
*/

$lang['pwd_reset'] = 'Для подтверждения сброса пароля отправлен email на вашу почту.';
$lang['pwd_reset_subject'] = "Запрос на сброс пароля администратора FUEL";
$lang['pwd_reset_email'] = "Нажмите на эту ссылку для подтверждения сброса вашего пароля:\n%1s";
$lang['pwd_reset_subject_success'] = "Пароль администратора FUEL успешно сброшен";
$lang['pwd_reset_email_success'] = "Ваш пароль FUEL был сброшен на %1s.";
$lang['pwd_reset_success'] = 'Ваш пароль был успешно сброшен и отправлен на ваш email.';
$lang['cache_cleared'] = "Кеш сайта успешно очищен";
$lang['module_restored_success'] = 'Предыдущая версия успешно восстановлена.';


/*
|--------------------------------------------------------------------------
| Nav Menu Titles
|--------------------------------------------------------------------------
*/

$lang['nav_dashboard'] = 'Панель управления';
$lang['nav_pages'] = 'Страницы';
$lang['nav_blocks'] = 'Блоки';
$lang['nav_navigation'] = 'Навигация';
$lang['nav_assets'] = 'Ресурсы';
$lang['nav_sitevariables'] = 'Переменные сайта';
$lang['nav_users'] = 'Пользователи';
$lang['nav_permissions'] = 'Права доступа';
$lang['nav_manage/cache'] = 'Кэш страницы';
$lang['nav_manage/activity'] = 'Лог активности';


/*
|--------------------------------------------------------------------------
| Error Messages
|--------------------------------------------------------------------------
*/
$lang['error_no_access'] = "У вас нет доступа к этой странице.";
$lang['error_missing_module'] = "Модуль %1s отсутствует.";
$lang['error_invalid_login'] = 'Неправильный логин.';
$lang['error_max_attempts'] = 'Извините, но информация о вашем логине неверная и вы временно заблокированы. Пожалуйста, попробуйте ещё раз через %s секунд.';
$lang['error_empty_user_pwd'] = 'Пожалуйста, введите имя пользователя и пароль.';
$lang['error_pwd_reset'] = 'Ошибка сброса пароля.';
$lang['error_invalid_email'] = 'Такой email адрес не зарегестрирован в системе.';
$lang['error_empty_email'] = 'Пожалуйста введите адрес email.';
$lang['error_no_permissions'] = 'У вас нет прав для завершения этого действия.';
$lang['error_page_layout_variable_conflict'] = 'Ошибка в файле макета, так как он содержит одно или более зарезервированное значение: %1s';
$lang['error_invalid_export_dir'] = 'Директория %1s не подходит для экпорта. Убедитесь что она доступна для записи.';
$lang['error_exporting_to_directory'] = 'Ошибка записи в одну или несколько директорий. Посмотрите вывод для остальной информации.';
$lang['error_cache_folder_not_writable'] = 'Вы должны сделать папку с кешем '.BASEPATH.'cache/ доступной к записи.';
$lang['error_exporting_view'] = 'Ошибка создания связанного вида для этого адреса %1s потому что переменная с именем <strong><em>%2s</em></strong> не существует.';
$lang['error_no_curl_lib'] = 'У вас должен быть установлен curl что-бы использовать этот инструмент.';
$lang['error_inline_page_edit'] = 'Эта переменная должна быть связана в файле views/_variables.';
$lang['error_saving'] = 'При сохранении произошла ошибка.';
$lang['error_cannot_preview'] = 'Произошла ошибка при попытке просмотра этой страницы.';
$lang['error_cannot_make_api_call'] = 'Ошибка вызова API для %1s.';
$lang['error_sending_email'] = 'Ошибка отправки email для %1s.';
$lang['error_nav_upload'] = 'Ошибка загрузки навигационного файла.';
$lang['error_create_nav_group'] = 'Пожалуйста, создайте группу навигации';
$lang['error_requires_string_value'] = 'Имя поля должно быть строковым';
$lang['error_missing_params'] = 'Не хватает параметров для просмотра этой страницы';


/*
|--------------------------------------------------------------------------
| Warnings
|--------------------------------------------------------------------------
*/
$lang['warn_change_default_pwd'] = '<strong>Рекомендовано сменить пароль на отличный от стандартного <em>%1s</em></strong>.';
$lang['warn_not_published'] = 'Этот элемент не опубликован.';
$lang['warn_not_active'] = 'Этот %1s не активен.';


/*
|--------------------------------------------------------------------------
| H2 Values
|--------------------------------------------------------------------------
*/
$lang['h2_pages'] = 'Страницы';
$lang['h2_navigation'] = 'Навигация';
$lang['h2_blocks'] = 'Блоки';
$lang['h2_assets'] = 'Ресурсы';
$lang['h2_sitevariables'] = 'Переменные сайта';

$lang['h2_manage'] = 'Управление';
$lang['h2_activty'] = 'Активность';
$lang['h2_page_cache'] = 'Кеш страниц';
$lang['h2_my_modules'] = 'Мои модули';
$lang['h2_tools'] = 'Инструменты';


/*
|--------------------------------------------------------------------------
| Instructions
|--------------------------------------------------------------------------
*/
$lang['page_cache_instructions'] = 'Вы собираетесь очистить кеш страниц сайта.';


/*
|--------------------------------------------------------------------------
| Pages
|--------------------------------------------------------------------------
*/

$lang['page_route_warning'] = 'The location specified has the following routes already specified in the routes file (%1s):';
$lang['page_controller_assigned'] = 'Метод контроллера уже назначен на эту страницу.';
$lang['page_updated_view'] = 'There is an updated view file located at <strong>%1s</strong>. Would you like to import it into the body of your page (if available)?';
$lang['page_not_published'] = 'Эта страница не опубликована.';
$lang['page_no_import'] = 'Нет, не импортировать';
$lang['page_yes_import'] = 'Да, импортировать';
$lang['page_information'] = 'Информация о странице';
$lang['page_layout_vars'] = 'Layout Variables';

/*
|--------------------------------------------------------------------------
| Blocks
|--------------------------------------------------------------------------
*/
$lang['blocks_updated_view'] = 'There is an updated view file located at <strong>%1s</strong>. Would you like to import?';


/*
|--------------------------------------------------------------------------
| Modal
|--------------------------------------------------------------------------
*/
$lang['modal_no_btn'] = 'Нет';
$lang['modal_yes_btn'] = 'Да';


/*
|--------------------------------------------------------------------------
| Misc
|--------------------------------------------------------------------------
*/
$lang['success_nav_upload'] = 'Навигация успешно загружена.';





/* End of file fuel_lang.php */
/* Location: ./modules/fuel/language/english/fuel_lang.php */
